
## :x: Apply Failed (account-data-deleter-cdk-dev)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/14107)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
data.terraform_remote_state.incident_management: Read complete after 1s
null_resource.accountdatadeleter_datadeleterapp_application_ecsservice_createtaskdefinitionfile_AAB061DA: Refreshing state... [id=1994519729590617805]
data.archive_file.batchdeletelambda_batch-delete-lambda_lambda-default-file_93768F47: Reading...
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=PT5XYTA]
pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutysentry99B408D5noncritical_ACB7223B: Refreshing state... [id=PJLMPHQ]
pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutycloudwatch12CCD26Enoncritical_860F0950: Refreshing state... [id=PGPBP50]
pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutycloudwatch12CCD26Ecritical_1C21027D: Refreshing state... [id=PCDQOSA]
data.archive_file.event-consumer_sqs-event-consumer_lambda_lambda-default-file_2256A51A: Reading...
pagerduty_service_integration.accountdatadeleter_pagerduty_accountdatadeleterpagerdutysentry99B408D5critical_DAE89EC3: Refreshing state... [id=PZ42NDN]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=PPW9XEN]
data.archive_file.event-consumer_sqs-event-consumer_lambda_lambda-default-file_2256A51A: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
data.archive_file.batchdeletelambda_batch-delete-lambda_lambda-default-file_93768F47: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
aws_iam_role.accountdatadeleter_datadeleterapp_codepipeline_codepipelinerole_FE92DD12: Refreshing state... [id=AccountDataDeleter-Dev-CodePipelineRole]
aws_iam_role_policy.accountdatadeleter_datadeleterapp_application_autoscaling_autoscalingrolepolicy_CF0C47E5: Refreshing state... [id=AccountDataDeleter-Dev-AutoScalingRole:AccountDataDeleter-Dev-AutoScalingPolicy]
aws_ecs_cluster.data-deleter-app_application_ecs_cluster_72BD4946: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:cluster/AccountDataDeleter-Dev]
aws_codedeploy_app.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deploy-app_F69B4EF8: Refreshing state... [id=fceee71c-c660-4e26-8fe1-5ad77acbc7c5:AccountDataDeleter-Dev-BatchDeleteLambda-Lambda]
data.aws_region.pocket-vpc_current_region_1602AAD6: Reading...
data.aws_region.pocket-vpc_current_region_1602AAD6: Read complete after 0s [id=us-east-1]
aws_s3_bucket.event-consumer_sqs-event-consumer_lambda_code-bucket_484E6323: Refreshing state... [id=pocket-accountdatadeleter-dev-sqs-event-consumer]
data.aws_kms_alias.kms_alias: Reading...
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
aws_iam_role_policy.accountdatadeleter_datadeleterapp_codepipeline_codepipelinerolepolicy_B7FB2020: Refreshing state... [id=AccountDataDeleter-Dev-CodePipelineRole:AccountDataDeleter-Dev-CodePipeline-Role-Policy]
data.aws_sns_topic.backend_notifications: Reading...
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:410318598490:Backend-Dev-ChatBot]
aws_dynamodb_table.batchdeletelambda_HistoricalDeletedUsers-Pending_dynamodb_table_225C7A6D: Refreshing state... [id=ADD-HistoricalDeletedUsers-Pending]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Reading...
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
aws_cloudwatch_log_group.accountdatadeleter_datadeleterapp_xraydaemonloggroup_E52AF4B6: Refreshing state... [id=/Backend/AccountDataDeleter-Dev/ecs/xray-daemon]
aws_iam_role.accountdatadeleter_datadeleterapp_application_autoscaling_autoscalingrole_9BE4F2CB: Refreshing state... [id=AccountDataDeleter-Dev-AutoScalingRole]
aws_s3_bucket.accountdatadeleter_datadeleterapp_codepipeline_codepipelinebucket_0C42896B: Refreshing state... [id=pocket-codepipeline-c24d52750c2ab54714dacfbc9b956d56]
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_assume-policy-document_8DB23EF4: Reading...
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_assume-policy-document_8DB23EF4: Read complete after 0s [id=1349007126]
aws_codepipeline.accountdatadeleter_datadeleterapp_codepipeline_codepipeline_AEA871BB: Refreshing state... [id=AccountDataDeleter-Dev-CodePipeline]
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deploy-assume-role-policy-document_53EA38C8: Reading...
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deploy-assume-role-policy-document_53EA38C8: Read complete after 0s [id=4250039221]
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_public_subnets_FCE306F6: Reading...
data.aws_region.region: Reading...
data.aws_region.region: Read complete after 0s [id=us-east-1]
aws_route53_zone.data-deleter-app_application_base_dns_subhosted_zone_0A436834: Refreshing state... [id=Z058689626IKKLL6GJEUB]
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_public_subnets_FCE306F6: Read complete after 0s [id=/Shared/PublicSubnets]
aws_sqs_queue.event-consumer_user-events-sns-subscription_sns-topic-dql_64AC6C4E: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDataDeleter-Dev-SNS-Topic-DLQ]
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-assume_F62BA8C5: Reading...
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-assume_F62BA8C5: Read complete after 0s [id=1077804475]
data.aws_region.data-deleter-app_application_ecs_service_ecs_codedeploy_current_region_C76CD263: Reading...
data.aws_region.data-deleter-app_application_ecs_service_ecs_codedeploy_current_region_C76CD263: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Reading...
data.aws_ssm_parameter.event-consumer_sqs-event-consumer_service-hash_868F8863: Reading...
aws_codedeploy_app.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_code_deploy_3F6E9850: Refreshing state... [id=c0d73baa-1a4e-4581-9de6-28f8a1eb276a:AccountDataDeleter-Dev-ECS]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Read complete after 0s [id=410318598490]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Reading...
aws_s3_bucket.batchdeletelambda_batch-delete-lambda_code-bucket_1341E11E: Refreshing state... [id=pocket-accountdatadeleter-dev-batchdeletelambda]
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_private_subnets_84F720F4: Reading...
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 0s [id=PKAPG94]
data.aws_ssm_parameter.event-consumer_sqs-event-consumer_service-hash_868F8863: Read complete after 1s [id=/AccountDataDeleter/CircleCI/Dev/SERVICE_HASH]
data.aws_route53_zone.data-deleter-app_application_base_dns_main_hosted_zone_47FDCB81: Reading...
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Read complete after 1s [id=/Shared/PrivateSubnets]
data.aws_caller_identity.data-deleter-app_application_ecs_service_ecs_codedeploy_current_account_87CE4B60: Reading...
data.aws_ssm_parameter.event-consumer_sqs-event-consumer_sentry-dsn_5C32B564: Reading...
aws_acm_certificate.data-deleter-app_application_alb_certificate_FD655806: Refreshing state... [id=arn:aws:acm:us-east-1:410318598490:certificate/158a133f-9e87-42b8-bb30-8f9fd9c03046]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 1s [id=PZQ6AUS]
data.aws_caller_identity.data-deleter-app_application_ecs_service_ecs_codedeploy_current_account_87CE4B60: Read complete after 0s [id=410318598490]
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:AccountDataDeleter-Dev-Infrastructure-Alarm-Non-Critical]
data.aws_ssm_parameter.batchdeletelambda_sentry-dsn_262DD7F7: Reading...
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_private_subnets_84F720F4: Read complete after 1s [id=/Shared/PrivateSubnets]
data.aws_ssm_parameter.batchdeletelambda_service-hash_4B4D1C4B: Reading...
aws_cloudwatch_log_group.data-deleter-app_app-log-group_AD731D31: Refreshing state... [id=/Backend/AccountDataDeleter-Dev/ecs/app]
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_vpc_ssm_param_4FF9713E: Reading...
data.aws_ssm_parameter.event-consumer_sqs-event-consumer_sentry-dsn_5C32B564: Read complete after 0s [id=/AccountDataDeleter/Dev/SENTRY_DSN]
data.aws_ssm_parameter.batchdeletelambda_service-hash_4B4D1C4B: Read complete after 0s [id=/AccountDataDeleter/CircleCI/Dev/SERVICE_HASH]
data.aws_ssm_parameter.batchdeletelambda_sentry-dsn_262DD7F7: Read complete after 0s [id=/AccountDataDeleter/Dev/SENTRY_DSN]
data.aws_caller_identity.data-deleter-app_application_pocket_vpc_current_identity_282F68FB: Reading...
data.aws_kms_alias.data-deleter-app_application_pocket_vpc_secrets_manager_key_76639B0A: Reading...
aws_codedeploy_app.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-app_8782CBBF: Refreshing state... [id=f862754f-2bac-453e-8469-3fb97a91117f:AccountDataDeleter-Dev-Sqs-Event-Consumer-Lambda]
data.aws_region.data-deleter-app_application_pocket_vpc_current_region_9BAA1E59: Reading...
data.aws_caller_identity.data-deleter-app_application_pocket_vpc_current_identity_282F68FB: Read complete after 0s [id=410318598490]
data.aws_region.data-deleter-app_application_pocket_vpc_current_region_9BAA1E59: Read complete after 0s [id=us-east-1]
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:AccountDataDeleter-Dev-Infrastructure-Alarm-Critical]
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_vpc_ssm_param_4FF9713E: Read complete after 0s [id=/Shared/Vpc]
aws_sqs_queue.event-consumer_sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_05E61A7A: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDataDeleter-Dev-Sqs-Event-Consumer-Queue-Deadletter]
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs_codedeploy_codedeploy_assume_role_EDBA94BC: Reading...
data.aws_kms_alias.data-deleter-app_application_pocket_vpc_secrets_manager_key_76639B0A: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-assume-role-policy-document_819DEF39: Reading...
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs_codedeploy_codedeploy_assume_role_EDBA94BC: Read complete after 0s [id=4250039221]
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-assume-role-policy-document_819DEF39: Read complete after 0s [id=4250039221]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Reading...
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_execution-policy-document_B8D98A18: Reading...
aws_sqs_queue.batch-delete-consumer-queue_redrive_sqs_queue_B3F8A415: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDataDeleter-Dev-Sqs-Batch-Delete-Consumer-Queue-Deadletter]
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_execution-policy-document_B8D98A18: Read complete after 0s [id=2591764522]
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_execution-policy-document_48A37D72: Reading...
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_execution-policy-document_48A37D72: Read complete after 0s [id=2591764522]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Reading...
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_assume-policy-document_399C5D83: Reading...
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Read complete after 0s [id=/Shared/Vpc]
aws_ecr_repository.data-deleter-app_application_ecs_service_ecr-app_ecr-repo_3026A62A: Refreshing state... [id=accountdatadeleter-dev-app]
aws_s3_bucket_public_access_block.event-consumer_sqs-event-consumer_lambda_code-bucket-public-access-block_AF8F837A: Refreshing state... [id=pocket-accountdatadeleter-dev-sqs-event-consumer]
aws_dynamodb_table.batchdeletelambda_HistoricalDeletedUsers-Processed_dynamodb_table_889BF31E: Refreshing state... [id=ADD-HistoricalDeletedUsers-Processed]
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_assume-policy-document_399C5D83: Read complete after 0s [id=1349007126]
data.aws_caller_identity.caller: Reading...
aws_iam_role.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deploy-role_9D02E0E0: Refreshing state... [id=AccountDataDeleter-Dev-BatchDeleteLambda-CodeDeployRole]
aws_iam_role.batchdeletelambda_batch-delete-lambda_execution-role_28D715FA: Refreshing state... [id=AccountDataDeleter-Dev-BatchDeleteLambda-ExecutionRole]
data.aws_caller_identity.caller: Read complete after 0s [id=410318598490]
aws_iam_role.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-role_91290640: Refreshing state... [id=AccountDataDeleter-Dev-TaskRole]
aws_iam_role.data-deleter-app_application_ecs_service_ecs-iam_ecs-execution-role_A0A8D414: Refreshing state... [id=AccountDataDeleter-Dev-TaskExecutionRole]
data.aws_iam_policy_document.event-consumer_user-events-sns-subscription_sns-dlq-policy-document_F0C4881F: Reading...
data.aws_iam_policy_document.event-consumer_user-events-sns-subscription_sns-dlq-policy-document_F0C4881F: Read complete after 0s [id=3281761693]
aws_codestarnotifications_notification_rule.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_415EAA02: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:410318598490:notificationrule/a9c3c55b134915b3743480ca9d93deb62c1d02bc]
data.aws_route53_zone.data-deleter-app_application_base_dns_main_hosted_zone_47FDCB81: Read complete after 0s [id=ZCSIDA846KWLN]
data.aws_vpc.data-deleter-app_application_pocket_vpc_7062C2E1: Reading...
aws_iam_role.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-role_09F928DA: Refreshing state... [id=AccountDataDeleter-Dev-Sqs-Event-Consumer-CodeDeployRole]
aws_iam_role.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_C71A976C: Refreshing state... [id=AccountDataDeleter-Dev-ECSCodeDeployRole]
aws_iam_policy.event-consumer_sqs-event-consumer_lambda_execution-policy_99388433: Refreshing state... [id=arn:aws:iam::410318598490:policy/AccountDataDeleter-Dev-Sqs-Event-Consumer-ExecutionRolePolicy]
aws_iam_policy.batchdeletelambda_batch-delete-lambda_execution-policy_0CB4B8C7: Refreshing state... [id=arn:aws:iam::410318598490:policy/AccountDataDeleter-Dev-BatchDeleteLambda-ExecutionRolePolicy]
aws_route53_record.data-deleter-app_application_alb_certificate_certificate_record_88681242: Refreshing state... [id=Z058689626IKKLL6GJEUB__a40afd8884085aeb407d929477d79a31.account-data-deleter-api.getpocket.dev._CNAME]
aws_sqs_queue.event-consumer_sqs-event-consumer_lambda_sqs_queue_01854365: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDataDeleter-Dev-Sqs-Event-Consumer-Queue]
aws_sqs_queue.batch-delete-consumer-queue_sqs_queue_D3FD6851: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDataDeleter-Dev-Sqs-Batch-Delete-Consumer-Queue]
data.aws_vpc.pocket-vpc_2587E211: Reading...
aws_iam_role.event-consumer_sqs-event-consumer_lambda_execution-role_DF2EA7D3: Refreshing state... [id=AccountDataDeleter-Dev-Sqs-Event-Consumer-ExecutionRole]
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_297BA29E: Reading...
aws_sqs_queue_policy.event-consumer_user-events-sns-subscription_sns-dlq-policy_5F8E8B35: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDataDeleter-Dev-SNS-Topic-DLQ]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:AccountDataDeleter-Dev-Infrastructure-Alarm-Critical:60684ae9-e9c0-460a-bd26-7f45c78baa72]
data.aws_iam_policy_document.batchdeletelambda_BatchDeleteLambda-lambda-dynamo-policy-doc_BB5F5C92: Reading...
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_297BA29E: Read complete after 0s [id=1398253173]
data.aws_iam_policy_document.batchdeletelambda_BatchDeleteLambda-lambda-dynamo-policy-doc_BB5F5C92: Read complete after 0s [id=1927231174]
aws_s3_bucket_public_access_block.batchdeletelambda_batch-delete-lambda_code-bucket-public-access-block_1A938E94: Refreshing state... [id=pocket-accountdatadeleter-dev-batchdeletelambda]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:AccountDataDeleter-Dev-Infrastructure-Alarm-Non-Critical:89c2de1a-c8e2-4d5d-b51a-7d8220c02378]
aws_route53_record.data-deleter-app_application_base_dns_subhosted_zone_ns_D71A4B22: Refreshing state... [id=ZCSIDA846KWLN_account-data-deleter-api.getpocket.dev_NS]
aws_ecr_lifecycle_policy.data-deleter-app_application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_0035C10E: Refreshing state... [id=accountdatadeleter-dev-app]
aws_iam_role_policy_attachment.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deploy-policy-attachment_70043CD9: Refreshing state... [id=AccountDataDeleter-Dev-BatchDeleteLambda-CodeDeployRole-20221110232847382000000001]
aws_codedeploy_deployment_group.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deployment-group_C5F30D1B: Refreshing state... [id=bede2d32-5152-4112-bf72-e079329c289b]
aws_iam_role_policy_attachment.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_1BBB86C3: Refreshing state... [id=AccountDataDeleter-Dev-TaskExecutionRole-20220602010817850800000009]
aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07: Refreshing state... [id=AccountDataDeleter-Dev]
aws_codedeploy_deployment_group.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deployment-group_25E98995: Refreshing state... [id=fa584e7d-326f-4dd7-817e-c90cf1b07be0]
aws_iam_role_policy_attachment.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-policy-attachment_DAFAA787: Refreshing state... [id=AccountDataDeleter-Dev-Sqs-Event-Consumer-CodeDeployRole-20220602014111979800000002]
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_sqs_policy_87BD2525: Reading...
aws_iam_role_policy_attachment.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_C5DC6D5A: Refreshing state... [id=AccountDataDeleter-Dev-ECSCodeDeployRole-2022060201081811080000000d]
data.aws_iam_policy_document.event-consumer_user-events-sns-subscription_sns-sqs-policy-document_A53F50B3: Reading...
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_sqs_policy_87BD2525: Read complete after 0s [id=401209748]
data.aws_iam_policy_document.event-consumer_user-events-sns-subscription_sns-sqs-policy-document_A53F50B3: Read complete after 0s [id=3414048138]
aws_iam_role_policy_attachment.batchdeletelambda_batch-delete-lambda_execution-role-policy-attachment_2D695129: Refreshing state... [id=AccountDataDeleter-Dev-BatchDeleteLambda-ExecutionRole-20221110232847839700000002]
aws_sns_topic_subscription.event-consumer_user-events-sns-subscription_164DD4AB: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserEventTopic:ccd06c1d-e39e-4264-b9e5-ba7be454f05b]
data.aws_vpc.data-dele

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

                      = {
            "environment" = "Dev"
            "service"     = "AccountDataDeleter"
        }
        # (14 unchanged attributes hidden)
    }

  # aws_sqs_queue.accountdatadeleter_eventconsumer_sqseventconsumer_lambdasqsqueue_redrivesqsqueue_99E9E825 has moved to aws_sqs_queue.event-consumer_sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_05E61A7A
    resource "aws_sqs_queue" "event-consumer_sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_05E61A7A" {
        id                                = "https://sqs.us-east-1.amazonaws.com/410318598490/AccountDataDeleter-Dev-Sqs-Event-Consumer-Queue-Deadletter"
        name                              = "AccountDataDeleter-Dev-Sqs-Event-Consumer-Queue-Deadletter"
        tags                              = {
            "environment" = "Dev"
            "service"     = "AccountDataDeleter"
        }
        # (12 unchanged attributes hidden)
    }

  # aws_sqs_queue.accountdatadeleter_eventconsumer_usereventssnssubscription_snstopicdql_A7941E81 has moved to aws_sqs_queue.event-consumer_user-events-sns-subscription_sns-topic-dql_64AC6C4E
    resource "aws_sqs_queue" "event-consumer_user-events-sns-subscription_sns-topic-dql_64AC6C4E" {
        id                                = "https://sqs.us-east-1.amazonaws.com/410318598490/AccountDataDeleter-Dev-SNS-Topic-DLQ"
        name                              = "AccountDataDeleter-Dev-SNS-Topic-DLQ"
        tags                              = {
            "environment" = "Dev"
            "service"     = "AccountDataDeleter"
        }
        # (13 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.accountdatadeleter_eventconsumer_usereventssnssubscription_snsdlqpolicy_C27C5AF3 has moved to aws_sqs_queue_policy.event-consumer_user-events-sns-subscription_sns-dlq-policy_5F8E8B35
    resource "aws_sqs_queue_policy" "event-consumer_user-events-sns-subscription_sns-dlq-policy_5F8E8B35" {
        id        = "https://sqs.us-east-1.amazonaws.com/410318598490/AccountDataDeleter-Dev-SNS-Topic-DLQ"
        # (2 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.accountdatadeleter_eventconsumer_usereventssnssubscription_snssqspolicy_FA60B53A has moved to aws_sqs_queue_policy.event-consumer_user-events-sns-subscription_sns-sqs-policy_16608F07
    resource "aws_sqs_queue_policy" "event-consumer_user-events-sns-subscription_sns-sqs-policy_16608F07" {
        id        = "https://sqs.us-east-1.amazonaws.com/410318598490/AccountDataDeleter-Dev-Sqs-Event-Consumer-Queue"
        # (2 unchanged attributes hidden)
    }

  # local_file.data-deleter-app_application_ecs_service_appspec_5FC42C09 will be created
  # (moved from local_file.accountdatadeleter_datadeleterapp_application_ecsservice_appspec_7CF72757)
  + resource "local_file" "data-deleter-app_application_ecs_service_appspec_5FC42C09" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

  # null_resource.accountdatadeleter_datadeleterapp_application_ecsservice_createtaskdefinitionfile_AAB061DA will be destroyed
  # (because null_resource.accountdatadeleter_datadeleterapp_application_ecsservice_createtaskdefinitionfile_AAB061DA is not in configuration)
  - resource "null_resource" "accountdatadeleter_datadeleterapp_application_ecsservice_createtaskdefinitionfile_AAB061DA" {
      - id       = "1994519729590617805" -> null
      - triggers = {
          - "alwaysRun" = "2023-05-24T16:14:13Z"
        } -> null
    }

  # pagerduty_service.pagerduty_pagerduty-critical_464EE7CD will be created
  # (moved from pagerduty_service.accountdatadeleter_pagerduty_pagerdutycritical_0D3094C0)
  + resource "pagerduty_service" "pagerduty_pagerduty-critical_464EE7CD" {
      + acknowledgement_timeout = "1800"
      + alert_creation          = "create_incidents"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "14400"
      + created_at              = (known after apply)
      + description             = "PagerDuty Critical"
      + escalation_policy       = "PXOQVEP"
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "AccountDataDeleter-Dev-PagerDuty-Critical"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + incident_urgency_rule {
          + type    = "constant"
          + urgency = "high"
        }
    }

  # pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938 will be created
  # (moved from pagerduty_service.accountdatadeleter_pagerduty_pagerdutynoncritical_C143F7FE)
  + resource "pagerduty_service" "pagerduty_pagerduty-non-critical_B4CB3938" {
      + acknowledgement_timeout = "1800"
      + alert_creation          = "create_incidents"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "14400"
      + created_at              = (known after apply)
      + description             = "PagerDuty Non-Critical"
      + escalation_policy       = "PXOQVEP"
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "AccountDataDeleter-Dev-PagerDuty-Non-Critical"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + incident_urgency_rule {
          + type    = "constant"
          + urgency = "low"
        }
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Amazon CloudWatch"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PZQ6AUS"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

  # pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197 will be created
  + resource "pagerduty_service_integration" "pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "Sentry"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PKAPG94"
    }

Plan: 15 to add, 3 to change, 12 to destroy.
null_resource.accountdatadeleter_datadeleterapp_application_ecsservice_createtaskdefinitionfile_AAB061DA: Destroying... [id=1994519729590617805]
null_resource.accountdatadeleter_datadeleterapp_application_ecsservice_createtaskdefinitionfile_AAB061DA: Destruction complete after 0s
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Destroying... [id=arn:aws:sns:us-east-1:410318598490:AccountDataDeleter-Dev-Infrastructure-Alarm-Critical:60684ae9-e9c0-460a-bd26-7f45c78baa72]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Destroying... [id=arn:aws:sns:us-east-1:410318598490:AccountDataDeleter-Dev-Infrastructure-Alarm-Non-Critical:89c2de1a-c8e2-4d5d-b51a-7d8220c02378]
aws_iam_role_policy.accountdatadeleter_datadeleterapp_application_autoscaling_autoscalingrolepolicy_CF0C47E5: Destroying... [id=AccountDataDeleter-Dev-AutoScalingRole:AccountDataDeleter-Dev-AutoScalingPolicy]
aws_cloudwatch_dashboard.data-deleter-app_application_cloudwatch-dashboard_E6D21985: Destroying... [id=AccountDataDeleter-Dev-ALBDashboard]
aws_codepipeline.accountdatadeleter_datadeleterapp_codepipeline_codepipeline_AEA871BB: Destroying... [id=AccountDataDeleter-Dev-CodePipeline]
aws_iam_role_policy.accountdatadeleter_datadeleterapp_codepipeline_codepipelinerolepolicy_B7FB2020: Destroying... [id=AccountDataDeleter-Dev-CodePipelineRole:AccountDataDeleter-Dev-CodePipeline-Role-Policy]
aws_s3_bucket_ownership_controls.event-consumer_sqs-event-consumer_lambda_code-bucket-ownership-controls_10A070E1: Creating...
aws_s3_bucket_ownership_controls.batchdeletelambda_batch-delete-lambda_code-bucket-ownership-controls_900DFC79: Creating...
aws_lambda_function.event-consumer_sqs-event-consumer_lambda_2F35855C: Modifying... [id=AccountDataDeleter-Dev-Sqs-Event-Consumer-Function]
aws_lambda_function.batchdeletelambda_batch-delete-lambda_9A38729B: Modifying... [id=AccountDataDeleter-Dev-BatchDeleteLambda-Function]
aws_iam_role_policy.accountdatadeleter_datadeleterapp_codepipeline_codepipelinerolepolicy_B7FB2020: Destruction complete after 0s
aws_iam_role_policy.accountdatadeleter_datadeleterapp_application_autoscaling_autoscalingrolepolicy_CF0C47E5: Destruction complete after 0s
aws_iam_role.accountdatadeleter_datadeleterapp_application_autoscaling_autoscalingrole_9BE4F2CB: Destroying... [id=AccountDataDeleter-Dev-AutoScalingRole]
aws_cloudwatch_dashboard.data-deleter-app_application_cloudwatch-dashboard_E6D21985: Destruction complete after 0s
aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07: Destroying... [id=AccountDataDeleter-Dev]
aws_codepipeline.accountdatadeleter_datadeleterapp_codepipeline_codepipeline_AEA871BB: Destruction complete after 0s
aws_iam_role.accountdatadeleter_datadeleterapp_codepipeline_codepipelinerole_FE92DD12: Destroying... [id=AccountDataDeleter-Dev-CodePipelineRole]
aws_s3_bucket.accountdatadeleter_datadeleterapp_codepipeline_codepipelinebucket_0C42896B: Destroying... [id=pocket-codepipeline-c24d52750c2ab54714dacfbc9b956d56]
aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07: Destruction complete after 0s
aws_cloudwatch_log_group.accountdatadeleter_datadeleterapp_xraydaemonloggroup_E52AF4B6: Destroying... [id=/Backend/AccountDataDeleter-Dev/ecs/xray-daemon]
aws_cloudwatch_log_group.accountdatadeleter_datadeleterapp_xraydaemonloggroup_E52AF4B6: Destruction complete after 0s
aws_iam_role.accountdatadeleter_datadeleterapp_application_autoscaling_autoscalingrole_9BE4F2CB: Destruction complete after 0s
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Destruction complete after 0s
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Creating...
aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07: Creating...
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Destruction complete after 0s
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Creating...
aws_s3_bucket_ownership_controls.event-consumer_sqs-event-consumer_lambda_code-bucket-ownership-controls_10A070E1: Creation complete after 0s [id=pocket-accountdatadeleter-dev-sqs-event-consumer]
aws_iam_role.accountdatadeleter_datadeleterapp_codepipeline_codepipelinerole_FE92DD12: Destruction complete after 0s
aws_s3_bucket_acl.event-consumer_sqs-event-consumer_lambda_code-bucket-acl_B144ED95: Creating...
aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07: Creation complete after 0s [id=AccountDataDeleter-Dev]
aws_cloudwatch_dashboard.data-deleter-app_application_cloudwatch-dashboard_E6D21985: Creating...
aws_s3_bucket_ownership_controls.batchdeletelambda_batch-delete-lambda_code-bucket-ownership-controls_900DFC79: Creation complete after 0s [id=pocket-accountdatadeleter-dev-batchdeletelambda]
local_file.data-deleter-app_application_ecs_service_appspec_5FC42C09: Creating...
aws_s3_bucket_acl.event-consumer_sqs-event-consumer_lambda_code-bucket-acl_B144ED95: Creation complete after 0s [id=pocket-accountdatadeleter-dev-sqs-event-consumer,private]
local_file.data-deleter-app_application_ecs_service_appspec_5FC42C09: Creation complete after 0s [id=001ffa7ab00555a1d9475431cd9875ae58340ddf]
aws_appautoscaling_target.data-deleter-app_application_autoscaling_autoscaling_target_02FF0938: Modifying... [id=service/AccountDataDeleter-Dev/AccountDataDeleter-Dev]
aws_s3_bucket_acl.batchdeletelambda_batch-delete-lambda_code-bucket-acl_5284C5E4: Creating...
aws_s3_bucket_acl.batchdeletelambda_batch-delete-lambda_code-bucket-acl_5284C5E4: Creation complete after 1s [id=pocket-accountdatadeleter-dev-batchdeletelambda,private]
aws_cloudwatch_dashboard.data-deleter-app_application_cloudwatch-dashboard_E6D21985: Creation complete after 1s [id=AccountDataDeleter-Dev]
aws_appautoscaling_target.data-deleter-app_application_autoscaling_autoscaling_target_02FF0938: Modifications complete after 1s [id=service/AccountDataDeleter-Dev/AccountDataDeleter-Dev]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Creation complete after 1s [id=PUPKWBA]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Creating...
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Creating...
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Creation complete after 1s [id=PQDZVMN]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Creating...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Creating...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Creation complete after 0s [id=P9XVM3T]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Creation complete after 0s [id=PQ6GMFG]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Creating...
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Creation complete after 1s [id=P5L7LR3]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Creating...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Creation complete after 1s [id=P2OJKBD]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Creation complete after 0s [id=arn:aws:sns:us-east-1:410318598490:AccountDataDeleter-Dev-Infrastructure-Alarm-Non-Critical:cc997eb8-6278-4916-bf07-cf8b747729b3]
aws_lambda_function.event-consumer_sqs-event-consumer_lambda_2F35855C: Modifications complete after 6s [id=AccountDataDeleter-Dev-Sqs-Event-Consumer-Function]
aws_lambda_function.batchdeletelambda_batch-delete-lambda_9A38729B: Modifications complete after 7s [id=AccountDataDeleter-Dev-BatchDeleteLambda-Function]
aws_s3_bucket.accountdatadeleter_datadeleterapp_codepipeline_codepipelinebucket_0C42896B: Still destroying... [id=pocket-codepipeline-c24d52750c2ab54714dacfbc9b956d56, 10s elapsed]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [10s elapsed]
aws_s3_bucket.accountdatadeleter_datadeleterapp_codepipeline_codepipelinebucket_0C42896B: Destruction complete after 17s
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [20s elapsed]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [30s elapsed]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [40s elapsed]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [50s elapsed]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [1m0s elapsed]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [1m10s elapsed]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [1m20s elapsed]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [1m30s elapsed]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [1m40s elapsed]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [1m50s elapsed]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Still creating... [2m0s elapsed]
╷
│ Warning: Deprecated attribute
│ 
│   on cdk.tf.json line 3126, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│ 3126:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
│ 
│ The attribute "integration_key" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 7 more similar warnings elsewhere)
╵
╷
│ Error: waiting for SNS Topic Subscription (arn:aws:sns:us-east-1:410318598490:AccountDataDeleter-Dev-Infrastructure-Alarm-Critical:d685bb97-b093-46bb-8cab-0e2e6bbb184d) confirmation: timeout while waiting for state to become 'false' (last state: 'true', timeout: 2m0s)
│ 
│   with aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84,
│   on cdk.tf.json line 3130, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│ 3130:       },
│ 
╵

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"4a33166a-4242-439f-b3d0-d2e95e84db77","JobName":"account-data-deleter_infrastructure_apply_dev","PRNumber":72,"Program":"tfcmt","SHA1":"813f28e6b7097a749cbb8b6de484850c42a7f563","Target":"account-data-deleter-cdk-dev","Vars":{}} -->